{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_9", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_7", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 16}}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "InvertedResidualBlock", "config": {"name": "inverted_residual_block_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 32}}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "InvertedResidualBlock", "config": {"name": "inverted_residual_block_3", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 32}}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_8", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 64}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_10", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_9", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 64}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_11", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_10", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 128}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_12", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_11", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 128}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_13", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_12", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 256}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_14", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_13", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 256}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_15", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_27", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_16", "trainable": true, "dtype": "float32"}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "same", "strides": [8, 8], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_17", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_7", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "mean_squared_error", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "mse", "dtype": "float32", "fn": "mean_squared_error"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "mae", "dtype": "float32", "fn": "mean_absolute_error"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0005000000237487257, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batch_normalization_27/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_20/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv2d_20/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_21/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_14/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [1], "dtype": "float32"}, {"name": "inverted_residual_block_2/conv2d_20/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "inverted_residual_block_2/conv2d_20/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_30/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_30/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/depthwise_conv2d_10/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "inverted_residual_block_2/depthwise_conv2d_10/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_31/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_31/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/conv2d_21/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block_2/conv2d_21/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_32/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_32/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/conv2d/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block_2/conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_30/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_30/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_31/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_31/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_32/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_2/batch_normalization_32/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/conv2d_22/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block_3/conv2d_22/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_33/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_33/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/depthwise_conv2d_11/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "inverted_residual_block_3/depthwise_conv2d_11/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_34/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_34/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/conv2d_23/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block_3/conv2d_23/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_35/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_35/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_33/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_33/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_34/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_34/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_35/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_3/batch_normalization_35/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/conv2d_28/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/conv2d_28/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_42/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_42/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/depthwise_conv2d_14/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/depthwise_conv2d_14/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_43/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_43/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/squeeze_and_excitation_block_10/dense_20/kernel", "shape": [128, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/squeeze_and_excitation_block_10/dense_20/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/squeeze_and_excitation_block_10/dense_21/kernel", "shape": [16, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/squeeze_and_excitation_block_10/dense_21/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/conv2d_29/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/conv2d_29/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_44/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_44/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/conv2d/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/conv2d/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_42/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_42/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_43/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_43/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_44/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_10/batch_normalization_44/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/conv2d_30/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/conv2d_30/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_45/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_45/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/depthwise_conv2d_15/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/depthwise_conv2d_15/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_46/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_46/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/squeeze_and_excitation_block_11/dense_22/kernel", "shape": [128, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/squeeze_and_excitation_block_11/dense_22/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/squeeze_and_excitation_block_11/dense_23/kernel", "shape": [16, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/squeeze_and_excitation_block_11/dense_23/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/conv2d_31/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/conv2d_31/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_47/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_47/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_45/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_45/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_46/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_46/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_47/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_11/batch_normalization_47/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/conv2d_32/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/conv2d_32/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_48/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_48/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/depthwise_conv2d_16/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/depthwise_conv2d_16/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_49/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_49/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/squeeze_and_excitation_block_12/dense_24/kernel", "shape": [256, 32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/squeeze_and_excitation_block_12/dense_24/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/squeeze_and_excitation_block_12/dense_25/kernel", "shape": [32, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/squeeze_and_excitation_block_12/dense_25/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/conv2d_33/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/conv2d_33/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_50/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_50/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/conv2d/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/conv2d/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_48/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_48/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_49/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_49/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_50/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_12/batch_normalization_50/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/conv2d_34/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/conv2d_34/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_51/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_51/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/depthwise_conv2d_17/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/depthwise_conv2d_17/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_52/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_52/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/squeeze_and_excitation_block_13/dense_26/kernel", "shape": [256, 32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/squeeze_and_excitation_block_13/dense_26/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/squeeze_and_excitation_block_13/dense_27/kernel", "shape": [32, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/squeeze_and_excitation_block_13/dense_27/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/conv2d_35/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/conv2d_35/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_53/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_53/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_51/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_51/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_52/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_52/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_53/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_13/batch_normalization_53/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/conv2d_18/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/conv2d_18/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_27/gamma", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_27/beta", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/depthwise_conv2d_9/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/depthwise_conv2d_9/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_28/gamma", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_28/beta", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/squeeze_and_excitation_block_7/dense_14/kernel", "shape": [16, 2], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/squeeze_and_excitation_block_7/dense_14/bias", "shape": [2], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/squeeze_and_excitation_block_7/dense_15/kernel", "shape": [2, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/squeeze_and_excitation_block_7/dense_15/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/conv2d_19/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/conv2d_19/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_29/gamma", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_29/beta", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/conv2d/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_27/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_27/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_28/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_28/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_29/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_7/batch_normalization_29/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/conv2d_24/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/conv2d_24/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_36/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_36/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/depthwise_conv2d_12/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/depthwise_conv2d_12/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_37/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_37/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/squeeze_and_excitation_block_8/dense_16/kernel", "shape": [64, 8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/squeeze_and_excitation_block_8/dense_16/bias", "shape": [8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/squeeze_and_excitation_block_8/dense_17/kernel", "shape": [8, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/squeeze_and_excitation_block_8/dense_17/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/conv2d_25/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/conv2d_25/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_38/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_38/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/conv2d/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_36/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_36/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_37/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_37/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_38/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_8/batch_normalization_38/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/conv2d_26/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/conv2d_26/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_39/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_39/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/depthwise_conv2d_13/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/depthwise_conv2d_13/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_40/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_40/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/squeeze_and_excitation_block_9/dense_18/kernel", "shape": [64, 8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/squeeze_and_excitation_block_9/dense_18/bias", "shape": [8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/squeeze_and_excitation_block_9/dense_19/kernel", "shape": [8, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/squeeze_and_excitation_block_9/dense_19/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/conv2d_27/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/conv2d_27/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_41/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_41/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_39/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_39/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_40/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_40/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_41/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_9/batch_normalization_41/moving_variance", "shape": [64], "dtype": "float32"}]}]}