{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "HardSwish", "config": {"name": "hard_swish", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 16}}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "InvertedResidualBlock", "config": {"name": "inverted_residual_block", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 32}}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "InvertedResidualBlock", "config": {"name": "inverted_residual_block_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 32}}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 64}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_1", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 64}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_2", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_3", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 128}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_3", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_4", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 128}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_4", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_5", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 2, "filters": 256}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_5", "trainable": true, "dtype": "float32"}}, {"class_name": "InvertedResidualBlockWithSE", "config": {"name": "inverted_residual_block_with_se_6", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": 1, "filters": 256}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_6", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_27", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_7", "trainable": true, "dtype": "float32"}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "same", "strides": [8, 8], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "HardSwish", "config": {"name": "hard_swish_8", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_7", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "mse", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "mse", "dtype": "float32", "fn": "mean_squared_error"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "mae", "dtype": "float32", "fn": "mean_absolute_error"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0005000000237487257, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batch_normalization_27/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_20/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv2d_20/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_21/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_14/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [1], "dtype": "float32"}, {"name": "inverted_residual_block/conv2d_3/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "inverted_residual_block/conv2d_3/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_3/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_3/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/depthwise_conv2d_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "inverted_residual_block/depthwise_conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_4/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_4/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/conv2d_4/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block/conv2d_4/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_5/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_5/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/conv2d/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block/conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_3/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_3/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_4/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_4/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_5/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block/batch_normalization_5/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/conv2d_5/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block_1/conv2d_5/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_6/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_6/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/depthwise_conv2d_2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "inverted_residual_block_1/depthwise_conv2d_2/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_7/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_7/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/conv2d_6/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "inverted_residual_block_1/conv2d_6/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_8/gamma", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_8/beta", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_6/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_6/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_7/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_7/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_8/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_1/batch_normalization_8/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/conv2d_1/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/conv2d_1/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization/gamma", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization/beta", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/depthwise_conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_1/beta", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/squeeze_and_excitation_block/dense/kernel", "shape": [16, 2], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/squeeze_and_excitation_block/dense/bias", "shape": [2], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/squeeze_and_excitation_block/dense_1/kernel", "shape": [2, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/squeeze_and_excitation_block/dense_1/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/conv2d_2/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/conv2d_2/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_2/gamma", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_2/beta", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/conv2d/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_2/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se/batch_normalization_2/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/conv2d_7/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_9/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_9/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/depthwise_conv2d_3/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/depthwise_conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_10/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_10/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/squeeze_and_excitation_block_1/dense_2/kernel", "shape": [64, 8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/squeeze_and_excitation_block_1/dense_2/bias", "shape": [8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/squeeze_and_excitation_block_1/dense_3/kernel", "shape": [8, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/squeeze_and_excitation_block_1/dense_3/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/conv2d_8/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/conv2d_8/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_11/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_11/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/conv2d/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_9/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_9/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_10/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_10/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_11/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_1/batch_normalization_11/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/conv2d_9/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/conv2d_9/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_12/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_12/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/depthwise_conv2d_4/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/depthwise_conv2d_4/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_13/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_13/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/squeeze_and_excitation_block_2/dense_4/kernel", "shape": [64, 8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/squeeze_and_excitation_block_2/dense_4/bias", "shape": [8], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/squeeze_and_excitation_block_2/dense_5/kernel", "shape": [8, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/squeeze_and_excitation_block_2/dense_5/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/conv2d_10/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/conv2d_10/bias", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_14/gamma", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_14/beta", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_12/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_12/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_13/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_13/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_14/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_2/batch_normalization_14/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/conv2d_11/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/conv2d_11/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_15/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_15/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/depthwise_conv2d_5/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/depthwise_conv2d_5/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_16/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_16/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/squeeze_and_excitation_block_3/dense_6/kernel", "shape": [128, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/squeeze_and_excitation_block_3/dense_6/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/squeeze_and_excitation_block_3/dense_7/kernel", "shape": [16, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/squeeze_and_excitation_block_3/dense_7/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/conv2d_12/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/conv2d_12/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_17/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_17/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/conv2d/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/conv2d/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_15/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_15/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_16/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_16/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_17/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_3/batch_normalization_17/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/conv2d_13/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/conv2d_13/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_18/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_18/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/depthwise_conv2d_6/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/depthwise_conv2d_6/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_19/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_19/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/squeeze_and_excitation_block_4/dense_8/kernel", "shape": [128, 16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/squeeze_and_excitation_block_4/dense_8/bias", "shape": [16], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/squeeze_and_excitation_block_4/dense_9/kernel", "shape": [16, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/squeeze_and_excitation_block_4/dense_9/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/conv2d_14/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/conv2d_14/bias", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_20/gamma", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_20/beta", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_18/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_18/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_19/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_19/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_20/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_4/batch_normalization_20/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/conv2d_15/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/conv2d_15/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_21/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_21/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/depthwise_conv2d_7/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/depthwise_conv2d_7/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_22/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_22/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/squeeze_and_excitation_block_5/dense_10/kernel", "shape": [256, 32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/squeeze_and_excitation_block_5/dense_10/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/squeeze_and_excitation_block_5/dense_11/kernel", "shape": [32, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/squeeze_and_excitation_block_5/dense_11/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/conv2d_16/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/conv2d_16/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_23/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_23/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/conv2d/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/conv2d/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_21/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_22/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_22/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_23/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_5/batch_normalization_23/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/conv2d_17/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/conv2d_17/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_24/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_24/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/depthwise_conv2d_8/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/depthwise_conv2d_8/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_25/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_25/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/squeeze_and_excitation_block_6/dense_12/kernel", "shape": [256, 32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/squeeze_and_excitation_block_6/dense_12/bias", "shape": [32], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/squeeze_and_excitation_block_6/dense_13/kernel", "shape": [32, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/squeeze_and_excitation_block_6/dense_13/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/conv2d_18/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/conv2d_18/bias", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_26/gamma", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_26/beta", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_24/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_24/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_25/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_25/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_26/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "inverted_residual_block_with_se_6/batch_normalization_26/moving_variance", "shape": [256], "dtype": "float32"}]}]}